abt-st/FIRMWARE-UPDATE-QUBE-ESP32/src/firmware/esp32_qube/esp32_qube.ino
// ============================================================
// QUBE Servo - Firmware base oficial
// Arquitectura: ESP32 + BTS7960 (IBT-2) + INA219 + LM2596 + CD40106BE Schmitt Trigger
// Fecha: 2026-05-28 (driver migrado de L298N a BTS7960 el 2026-06-08, commit 78b4e7e)
// ============================================================
// Topologia de potencia y logica:
// 1) Fuente principal (12V-15V) -> INA219 (serie) -> BTS7960 B+ (VS motor)
// 2) Fuente principal -> LM2596 -> 5V para logica auxiliar
// 3) Encoder servo (open-drain 5V) -> pull-up 4.7kΩ a 3.3V
//    -> Schmitt Trigger CD40106BE (doble inversion, Vcc=3.3V)
//    -> salida limpia ~3.3V -> ESP32 GPIO34/GPIO35
// 4) INA219 en I2C para telemetria de voltaje, corriente y potencia
// 5) GND comun entre potencia y logica (topologia estrella)
//
// Pines recomendados (BTS7960 / IBT-2):
// BTS7960 R_EN + L_EN -> GPIO25  (habilitacion; puentear R_EN->L_EN en el modulo)
// BTS7960 RPWM        -> GPIO26  (IN1: PWM sentido horario)
// BTS7960 LPWM        -> GPIO27  (IN2: PWM sentido antihorario)
// BTS7960 VCC (logica)-> 5V      | B+/B- -> potencia motor 12-15V (via INA219)
// Encoder servo A -> Schmitt INV_A (pin 1) -> GPIO34
// Encoder servo B -> Schmitt INV_C (pin 5) -> GPIO35
// INA219 SDA -> GPIO21
// INA219 SCL -> GPIO22
// CD40106BE Vcc -> 3.3V (pin 14), GND (pin 7), bypass 100nF
//
// Comandos Serial:
// m0, m1, m2, m6      -> modo 0: stop, 1: PWM manual, 2: PID posicion, 6: Deep RL
// p-255..255           -> PWM manual (solo en m1)
// s<grados>            -> setpoint de posicion (m2)
// kp<val>, ki<val>, kd<val>
// r                    -> reset encoder y PID
// kf<0|1>             -> activar/desactivar filtro de Kalman (LQG)
// ?                    -> imprime estado
// wifi_ssid<TuRed>     -> configurar SSID WiFi (guarda en NVS/Preferences)
// wifi_pass<TuClave>   -> configurar password WiFi (guarda en NVS/Preferences)
// wifi_info            -> mostrar configuracion WiFi actual
//
// Endpoints HTTP:
// GET /state               — estado completo (JSON)
// GET /cmd?m=2             — cambiar modo
// GET /cmd?s=45            — setpoint posición
// GET /cmd?p=100           — PWM manual (modo 1)
// GET /cmd?x=1             — parada segura
// GET /rl_state            — estado compacto para RL {th,al,thd,ald} (rad, rad/s)
// GET /rl_cmd?a=0.5        — acción RL [-1.0, 1.0]
// GET /rl_cmd?r=1          — reset encoders + estado RL
// ============================================================

#include <Arduino.h>
#include <WiFi.h>
#include <ESPAsyncWebServer.h>
#include <AsyncTCP.h>
#include <Wire.h>
#include "credentials.h"
#include <SPIFFS.h>
#include <ArduinoOTA.h>
#include <Update.h>
#include <Preferences.h>
#include "driver/pcnt.h"
#include "policy_weights.h"

// ══════════════════════════════════════════════════════════════════════════
// MODO 7: On-device RL inference (forward pass en ESP32)
// Red: [36 → 64 → 64 → 1], ReLU, Hardtanh(-2, 2)
// Observación: 4 pasos × [θ, α, cosθ, sinθ, cosα, sinα, θ̇, α̇, action]
// ══════════════════════════════════════════════════════════════════════════
constexpr int RL_HISTORY_STEPS = 4;
constexpr int RL_OBS_PER_STEP = 9;   // [θ, α, cosθ, sinθ, cosα, sinα, θ̇, α̇, action]
constexpr int RL_INPUT_DIM = RL_HISTORY_STEPS * RL_OBS_PER_STEP;  // 36
constexpr int RL_HIDDEN = 64;

float rl_obs_buf[RL_HISTORY_STEPS][RL_OBS_PER_STEP];
int rl_obs_idx = 0;
float rl_last_action = 0.0f;

// Forward pass: input[36] → output (action in [-2, 2] via Hardtanh)
float rl_forward(const float* input) {
    float h1[RL_HIDDEN];
    for (int j = 0; j < RL_HIDDEN; j++) {
        float sum = policy_weights::LAYER_0_BIAS[j];
        for (int k = 0; k < RL_INPUT_DIM; k++) {
            sum += policy_weights::LAYER_0_WEIGHT[j * RL_INPUT_DIM + k] * input[k];
        }
        h1[j] = sum > 0.0f ? sum : 0.0f;  // ReLU
    }
    float h2[RL_HIDDEN];
    for (int j = 0; j < RL_HIDDEN; j++) {
        float sum = policy_weights::LAYER_1_BIAS[j];
        for (int k = 0; k < RL_HIDDEN; k++) {
            sum += policy_weights::LAYER_1_WEIGHT[j * RL_HIDDEN + k] * h1[k];
        }
        h2[j] = sum > 0.0f ? sum : 0.0f;  // ReLU
    }
    float raw_out = policy_weights::LAYER_2_BIAS[0];
    for (int k = 0; k < RL_HIDDEN; k++) {
        raw_out += policy_weights::LAYER_2_WEIGHT[k] * h2[k];
    }
    // Hardtanh(-2, 2)
    return raw_out < -2.0f ? -2.0f : (raw_out > 2.0f ? 2.0f : raw_out);
}

// Build observation from current state and append to history
float rl_infer_step(float theta_rad, float alpha_rad, float theta_dot, float alpha_dot) {
    rl_obs_idx = (rl_obs_idx + 1) % RL_HISTORY_STEPS;
    rl_obs_buf[rl_obs_idx][0] = theta_rad;
    rl_obs_buf[rl_obs_idx][1] = alpha_rad;
    rl_obs_buf[rl_obs_idx][2] = cosf(theta_rad);
    rl_obs_buf[rl_obs_idx][3] = sinf(theta_rad);
    rl_obs_buf[rl_obs_idx][4] = cosf(alpha_rad);
    rl_obs_buf[rl_obs_idx][5] = sinf(alpha_rad);
    rl_obs_buf[rl_obs_idx][6] = theta_dot;
    rl_obs_buf[rl_obs_idx][7] = alpha_dot;
    rl_obs_buf[rl_obs_idx][8] = rl_last_action;

    // Flatten oldest-first into input[36]
    float input[RL_INPUT_DIM];
    for (int s = 0; s < RL_HISTORY_STEPS; s++) {
        int si = (rl_obs_idx - RL_HISTORY_STEPS + 1 + s + RL_HISTORY_STEPS) % RL_HISTORY_STEPS;
        for (int f = 0; f < RL_OBS_PER_STEP; f++) {
            input[s * RL_OBS_PER_STEP + f] = rl_obs_buf[si][f];
        }
    }

    float action = rl_forward(input);
    rl_last_action = action;
    return action;
}

#if defined(__has_include)
#if __has_include(<INA219_WE.h>)
#include <INA219_WE.h>
#define HAS_INA219 1
#endif
#endif

#ifndef HAS_INA219
// Fallback: permite compilar sin la libreria INA219 instalada.
class INA219_WE {
public:
  INA219_WE(TwoWire *wire = &Wire, uint8_t addr = 0x40) {
    (void)wire;
    (void)addr;
  }
  bool init() {
    return false;
  }
  void setMeasureMode(int mode) {
    (void)mode;
  }
  float getShuntVoltage_mV() {
    return 0.0f;
  }
  float getBusVoltage_V() {
    return 0.0f;
  }
  float getCurrent_mA() {
    return 0.0f;
  }
  float getBusPower() {
    return 0.0f;
  }
};
