abt-st/FIRMWARE-UPDATE-QUBE-ESP32/src/firmware/esp32_qube/esp32_qube.ino
enum INA219_MeasureMode { INA219_CONTINUOUS };
#endif

static const int PIN_ENC_A = 34;  // Encoder servo A
static const int PIN_ENC_B = 35;  // Encoder servo B
static const int PIN_PEND_A = 32;  // Encoder péndulo A
static const int PIN_PEND_B = 33;  // Encoder péndulo B

static const int PIN_ENA = 25;
static const int PIN_IN1 = 26;
static const int PIN_IN2 = 27;

// BTS7960: R_EN/L_EN habilitados por GPIO25 (opción B del README).
// Conectar GPIO25 → R_EN + puente R_EN→L_EN en el módulo IBT-2.
static const bool USE_ENA_PWM = false;

static const int PIN_I2C_SDA = 21;
static const int PIN_I2C_SCL = 22;

static const int PWM_CH_ENA = 0;
static const int PWM_CH_IN1 = 1;
static const int PWM_CH_IN2 = 2;
static const int PWM_FREQ_HZ = 20000;
static const int PWM_RES_BITS = 8;

bool pwmAttachCompat(int pin, int channel) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
  (void)channel;
  return ledcAttach(pin, PWM_FREQ_HZ, PWM_RES_BITS);
#else
  ledcSetup(channel, PWM_FREQ_HZ, PWM_RES_BITS);
  ledcAttachPin(pin, channel);
  return true;
#endif
}

void pwmWriteCompat(int pin, int channel, int duty) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
  (void)channel;
  ledcWrite(pin, duty);
#else
  (void)pin;
  ledcWrite(channel, duty);
#endif
}

float countsPerRev = 2048.0f;               // Ajustable en runtime con cpr<val>
int encoderDir = 1;                         // Ajustable en runtime con ed<1|-1>
float pendCountsPerRev = 2048.0f;           // CPR encoder péndulo
int pendulumDir = 1;                        // Dirección encoder péndulo

int mode = 0;
int lastPwmCmd = 0;
float lastServoPos = 0.0f;  // Posición del servo para soft saturation en setMotor
float setpoint_deg = 0.0f;
volatile float rlAction = 0.0f;  // Acción RL [-1.0, 1.0] — modo 6

// PID Servo (modo 2)
float Kp = 3.0f;
float Ki = 0.5f;
float Kd = 0.15f;
float integralTerm = 0.0f;
float prevPos = 0.0f;
float filteredVel = 0.0f;
float velAlpha = 0.12f;  // Filtro EMA velocidad servo (configurable por HTTP: va<val>)
float positionOffsetDeg = 0.0f;
// ── Gain Scheduling: Modo Fino vs Modo Grueso (modo 2) ──────────────────────
// Cuando |error| <= threshold -> usa gains finos (movimientos suaves)
// Cuando |error| > threshold  -> usa gains gruesos (respuesta rápida)
// Histéresis de ±hysteresis sobre el umbral para evitar chattering entre modos.
float Kp_fine = 2.0f;       // Ganancia proporcional modo fino
float Ki_fine = 0.8f;       // Ganancia integral modo fino
float Kd_fine = 0.2f;       // Ganancia derivativa modo fino
float Kp_coarse = 4.0f;     // Ganancia proporcional modo grueso
float Ki_coarse = 0.2f;     // Ganancia integral modo grueso
float Kd_coarse = 0.1f;     // Ganancia derivativa modo grueso
const float GAIN_THRESHOLD_DEG = 10.0f;  // Umbral para cambiar de modo (grados)
const float GAIN_HYSTERESIS_DEG = 2.0f;  // Histérisis sobre el umbral (grados)
int gainMode = 0;           // 0=fino, 1=grueso (estado actual, para telemetría)
bool useGainScheduling = false;  // true=activa dual-mode, false=PID clásico con gains Kp/Ki/Kd
float servo_ff_pwm = 0.0f;      // Feedforward: PWM constante para compensar torque gravitacional (desnivel mesa)
// prevPosPend: usado por swing-up (modo 5) para velocidad angular del péndulo
float prevPosPend = 0.0f;
const float VEL_ALPHA_PEND = 0.60f;  // Filtro velocidad péndulo (usado en LQR)
float swing_filteredVelAlpha = 0.0f;  // Filtro EMA velocidad péndulo para swing-up
float pendulumOffsetDeg = 0.0f;
// LQR Péndulo Invertido (modo 4)
// Ganancias LQR base (lejos del equilibrio)
float lqr_K1 = 2.0f;    // Ganancia posición servo
float lqr_K2 = 22.0f;   // Ganancia ángulo péndulo (valor original calibrado)
float lqr_K3 = 1.5f;
float lqr_K4 = 9.0f;    // Ganancia velocidad péndulo (valor original calibrado)

// Gain scheduling: gains moderados cerca del equilibrio
const float LQR_K2_NEAR = 30.0f;     // K2 cerca de vertical (probado: 55+ segundos)
const float LQR_K4_NEAR = 15.0f;     // K4 cerca de vertical (no subir a 20)
const float LQR_NEAR_DEG = 25.0f;    // Umbral para gains agresivos
const float LQR_K2_VERY_NEAR = 55.0f; // K2 cuando |alpha| < LQR_VERY_NEAR_DEG (muy cerca de vertical)
const float LQR_K4_VERY_NEAR = 20.0f; // K4 cuando |alpha| < LQR_VERY_NEAR_DEG
const float LQR_VERY_NEAR_DEG = 5.0f; // Umbral para gains muy agresivos
const float LQR_DAMPING_GAIN = 0.3f;  // Ganancia de disipación de energía dentro de LQR
float lqr_prevTheta = 0.0f;
float lqr_prevAlpha = 0.0f;
float lqr_filteredVelTheta = 0.0f;
float lqr_filteredVelAlpha = 0.0f;
bool lqr_inFallback = false;  // true mientras se está en swing-up por fallback LQR (evita rebote)
unsigned long lqr_fallbackMs = 0;  // Timestamp para fallback automático LQR→swing-up
unsigned long lqr_catchMs = 0;  // Timestamp para catch mode (frenado inicial al entrar a LQR)
const unsigned long LQR_CATCH_MS = 400;  // Duración del catch mode en ms (era 150, insuficiente para disipar inercia)
float pendPosRawPrev = 0.0f;  // Para detectar spinning
unsigned long spinCooldownMs = 0;  // Timestamp para cooldown post-spin
const unsigned long SPIN_COOLDOWN_MS = 1000;  // Duración del cooldown post-spin (ms)
// ── Filtro de Kalman (LQG) para LQR ─────────────────────────────────────────
// Estado: x = [theta, alpha, dtheta, dalpha] (4 estados)
// Medicion: z = [theta, alpha] (2 salidas — solo posiciones de encoder)
// Modelo linealizado del pendulo rotatorio invertido cerca del equilibrio vertical
bool kf_enabled = false;  // Toggle via HTTP: kf=1 / kf=0
// Matrices del modelo (discretizado con Euler, Ts = CONTROL_PERIOD_US)
// Ad = I + A*Ts (modelo discreto)
const float KF_TS = 0.002f;  // 500 Hz (2 ms)
// Parametros del modelo fisico para el KF
const float KF_MOTOR_GAIN = 50.0f;   // Ganancia motor: PWM -> deg/s^2 (ajustar experimentalmente)
const float KF_SERVO_FRIC = 2.0f;    // Friccion viscosa servo (1/s) — amortiguamiento
const float KF_PEND_FREQ = 12.3f;    // sqrt(g/l) del pendulo [rad/s] ≈ sqrt(9.81/0.065)
const float KF_PEND_FRIC = 0.5f;     // Friccion pendulo (1/s)
// Covarianzas (ajustables)
float kf_Q_pos = 0.1f;      // Ruido proceso: posicion (deg^2)
float kf_Q_vel = 10.0f;     // Ruido proceso: velocidad (deg/s^2) — mayor = confia mas en mediciones
float kf_R_pos = 0.5f;      // Ruido medicion: encoder (deg^2) — resolucion ~0.044°
// Estado estimado del KF
float kf_x[4] = {0.0f, 0.0f, 0.0f, 0.0f};  // [theta, alpha, dtheta, dalpha]
// Covarianza del error P (4x4, almacenada como array plano)
float kf_P[16] = {
  100.0f, 0.0f, 0.0f, 0.0f,
  0.0f, 100.0f, 0.0f, 0.0f,
  0.0f, 0.0f, 1000.0f, 0.0f,
  0.0f, 0.0f, 0.0f, 1000.0f
};
// Ganancia Kalman K (4x2)
float kf_K[8] = {0};

void kalmanReset() {
  kf_x[0] = 0.0f; kf_x[1] = 0.0f; kf_x[2] = 0.0f; kf_x[3] = 0.0f;
  // Reiniciar P a valores altos (incertidumbre inicial)
  for (int i = 0; i < 16; i++) kf_P[i] = 0.0f;
  kf_P[0] = 100.0f;   // theta
  kf_P[5] = 100.0f;   // alpha
  kf_P[10] = 1000.0f; // dtheta
  kf_P[15] = 1000.0f; // dalpha
}

// Predict: x_pred = Ad * x + Bd * u
//          P_pred = Ad * P * Ad^T + Q
// Ad es I + A*Ts (Euler discreto):
//   [1  0  Ts   0 ]
//   [0  1   0  Ts ]
//   [0  0 1-b1*Ts  0     ]   Bd = [0, 0, K_m*Ts, 0]^T
//   [0  w2*Ts  0  1-b2*Ts]
// donde w2 = (g/l)^2 (frecuencia natural al cuadrado, linearized)
void kalmanPredict(float pwmCmd) {
  const float Ts = KF_TS;
  const float b1s = KF_SERVO_FRIC * Ts;
  const float b2s = KF_PEND_FRIC * Ts;
  const float w2Ts = KF_PEND_FREQ * KF_PEND_FREQ * Ts;
  const float kmTs = KF_MOTOR_GAIN * Ts;
  // x_pred = Ad * x + Bd * u
  float x0 = kf_x[0] + Ts * kf_x[2];
  float x1 = kf_x[1] + Ts * kf_x[3];
  float x2 = (1.0f - b1s) * kf_x[2] + kmTs * pwmCmd;
  float x3 = w2Ts * kf_x[1] + (1.0f - b2s) * kf_x[3];
  kf_x[0] = x0; kf_x[1] = x1; kf_x[2] = x2; kf_x[3] = x3;
  // P_pred = Ad * P * Ad^T + Q (expanding since Ad is sparse)
  // Ad tiene forma: [I_2  Ts*I_2; Ad21  Ad22]
  // P es simetrica 4x4: indices [0..3][0..3] = P[i*4+j]
  float p00 = kf_P[0], p01 = kf_P[1], p02 = kf_P[2], p03 = kf_P[3];
  float p11 = kf_P[5], p12 = kf_P[6], p13 = kf_P[7];
  float p22 = kf_P[10], p23 = kf_P[11];
  float p33 = kf_P[15];
  // Ad*P (sparse multiplication)
  // Row 0: [p00+Ts*p02, p01+Ts*p03, p02+Ts*p22, p03+Ts*p23]
  float ap00 = p00 + Ts * p02;
  float ap01 = p01 + Ts * p03;
  float ap02 = p02 + Ts * p22;
  float ap03 = p03 + Ts * p23;
  // Row 1: [p01+Ts*p12, p11+Ts*p13, p12+Ts*p23, p13+Ts*p33]
  float ap10 = p01 + Ts * p12;
  float ap11 = p11 + Ts * p13;
  float ap12 = p12 + Ts * p23;
  float ap13 = p13 + Ts * p33;
  // Row 2: [(1-b1s)*p02, (1-b1s)*p12, (1-b1s)*p22, (1-b1s)*p23]
  float c2 = 1.0f - b1s;
  float ap20 = c2 * p02;
  float ap21 = c2 * p12;
  float ap22 = c2 * p22;
  float ap23 = c2 * p23;
  // Row 3: [w2Ts*p01+(1-b2s)*p03, w2Ts*p11+(1-b2s)*p13, w2Ts*p12+(1-b2s)*p23, w2Ts*p13+(1-b2s)*p33]
  float c3 = 1.0f - b2s;
  float ap30 = w2Ts * p01 + c3 * p03;
  float ap31 = w2Ts * p11 + c3 * p13;
  float ap32 = w2Ts * p12 + c3 * p23;
  float ap33 = w2Ts * p13 + c3 * p33;
  // P_new = Ad*P*Ad^T + Q, but Ad^T has structure:
  // [I_2      Ad21^T]
  // [Ts*I_2  Ad22^T]
  // where Ad21 = [0 w2Ts; 0 0], Ad22 = diag(1-b1s, 1-b2s)
  // Resultado (aprovechando simetria):
  kf_P[0]  = ap00 + Ts * ap02 + kf_Q_pos;                        // P[0][0]
  kf_P[1]  = ap01 + Ts * ap03;                                     // P[0][1]
  kf_P[2]  = ap02 + Ts * ap22;                                     // P[0][2]
  kf_P[3]  = ap03 + Ts * ap23;                                     // P[0][3]
  kf_P[5]  = ap11 + Ts * ap13 + kf_Q_pos;                        // P[1][1]
  kf_P[6]  = ap12 + Ts * ap23;                                     // P[1][2]
  kf_P[7]  = ap13 + Ts * ap33;                                     // P[1][3]
  kf_P[10] = c2 * ap22 + kf_Q_vel;                                // P[2][2]
  kf_P[11] = c2 * ap23;                                            // P[2][3]
  kf_P[15] = w2Ts * ap13 + c3 * ap33 + kf_Q_vel;                 // P[3][3]
  // Simetria
  kf_P[4]  = kf_P[1];
  kf_P[8]  = kf_P[2];  kf_P[9]  = kf_P[6];
  kf_P[12] = kf_P[3];  kf_P[13] = kf_P[7];  kf_P[14] = kf_P[11];
}

// Update: z = [theta_meas, alpha_meas]
// H = [1 0 0 0; 0 1 0 0] (mide solo posiciones)
// S = H*P*H^T + R = P[0:2,0:2] + R  (2x2)
// K = P*H^T * S^-1  (4x2)
// x = x + K*(z - H*x)
// P = (I - K*H)*P
void kalmanUpdate(float theta_meas, float alpha_meas) {
  // Innovation: y = z - H*x
  float y0 = theta_meas - kf_x[0];
  float y1 = alpha_meas - kf_x[1];
  // S = H*P*H^T + R (2x2 symmetric)
  float s00 = kf_P[0] + kf_R_pos;
  float s01 = kf_P[1];
  float s11 = kf_P[5] + kf_R_pos;
  // S^-1 (2x2 analytic inverse)
  float det = s00 * s11 - s01 * s01;
  if (det < 1e-10f) det = 1e-10f;  // Evitar singularidad
  float inv_det = 1.0f / det;
  float si00 = s11 * inv_det;
  float si01 = -s01 * inv_det;
  float si11 = s00 * inv_det;
  // K = P * H^T * S^-1
  // P*H^T = columnas 0 y 1 de P (4x2)
  // K[i][j] = sum_k P[i][k] * (H^T)[k][j] * S^-1...
  // K = [P[0], P[1]] * S^-1  (donde P[k] = columna k de P)
  float pcol0[4] = {kf_P[0], kf_P[4], kf_P[8], kf_P[12]};
  float pcol1[4] = {kf_P[1], kf_P[5], kf_P[9], kf_P[13]};
  for (int i = 0; i < 4; i++) {
    kf_K[i * 2]     = pcol0[i] * si00 + pcol1[i] * si01;
    kf_K[i * 2 + 1] = pcol0[i] * si01 + pcol1[i] * si11;
  }
  // x = x + K * y
  for (int i = 0; i < 4; i++) {
    kf_x[i] += kf_K[i * 2] * y0 + kf_K[i * 2 + 1] * y1;
  }
  // P = (I - K*H) * P
  // K*H es 4x2 * 2x4 = 4x4, pero H es [I 0], entonces K*H solo llena cols 0-1
  // P_new[i][j] = P[i][j] - K[i][0]*P[0][j] - K[i][1]*P[1][j]
  float P_new[16];
  for (int i = 0; i < 4; i++) {
    for (int j = 0; j < 4; j++) {
      P_new[i * 4 + j] = kf_P[i * 4 + j]
                        - kf_K[i * 2] * kf_P[j]
                        - kf_K[i * 2 + 1] * kf_P[4 + j];
    }
  }
  // Copiar resultado y forzar simetria
  for (int i = 0; i < 4; i++) {
    for (int j = i; j < 4; j++) {
      float val = 0.5f * (P_new[i * 4 + j] + P_new[j * 4 + i]);
      kf_P[i * 4 + j] = val;
      kf_P[j * 4 + i] = val;
    }
  }
}

