abt-st/FIRMWARE-UPDATE-QUBE-ESP32/src/firmware/esp32_qube/esp32_qube.ino
// Si el motor gira en direccion opuesta al encoder (feedback positivo),
// cambiar MOTOR_DIR a -1 para invertir la salida del PID.
const int MOTOR_DIR = -1;  // 1 = normal, -1 = invertido

const float INTEGRAL_LIMIT = 250.0f;
const int PWM_MIN = 12;
const int PWM_MAX = 100;

// Parametros del pendulo para calculo de energia (Quanser swing-up)
const float PEND_MASS = 0.025f;      // Masa del pendulo (kg) - ajustar
const float PEND_LENGTH = 0.065f;    // Distancia pivot-centro de masa (m) - ajustar
const float PEND_INERTIA = 0.00002f; // Momento de inercia (kg*m^2) - ajustar
const float PEND_LIMIT_DEG = 90.0f;    // Limite fisico del pendulo (±90° desde reposo)
const float GRAVITY = 9.81f;         // Gravedad (m/s^2)
float ke_gain = 0.65f;  // Ganancia BTS7960: 25% catch rate, hold 86s
// Adaptive ke_gain: increase energy gain when pendulum stalls
float swing_maxAngleAchieved = 0.0f;    // Max absolute angle achieved since last reset
unsigned long swing_lastImprovementMs = 0;  // Timestamp of last angle improvement
const float KE_GAIN_BASE = 0.75f;       // Base energy gain (era 0.65)
const float KE_GAIN_BOOST = 1.5f;       // Boosted gain when stalled (era 1.2)
const unsigned long STALL_TIMEOUT_MS = 6000;  // 6s without improvement → boost (era 4s)
// Complementary filter for velocity estimation (physics + measurement)
float swing_predictedVelAlpha = 0.0f;  // Physics-model predicted velocity
const float COMP_FILTER_ALPHA = 0.7f;  // Weight for measurement (0= pure model, 1= pure derivative)
const float PEND_DAMPING = 0.02f;  // Estimated damping coefficient (N·m·s/rad)
float balance_threshold = 1.0f;     // Umbral para cambiar a LQR (grados desde vertical) - reducido de 3
bool swing_recovering = false;       // Estado de recovery: motor apagado esperando que el péndulo caiga
const float SWING_RECOVERY_THRESHOLD = 30.0f;  // |pendPos| < esto para salir de recovery (cerca del fondo)
const unsigned long CONTROL_PERIOD_US = 2000;             // 500 Hz (era 5000 = 200 Hz)
int swingupPwmMax = 50;  // PWM limit para swing-up (configurable por HTTP: sp<val>)
unsigned long telemetryPeriodMs = 100;          // Ajustable por HTTP: tp<ms>
float prev_alpha_dot_peak = 0.0f;  // Peak detection para transicion LQR
const unsigned long COMMAND_TIMEOUT_MS = 10000;
const bool ENABLE_COMMAND_TIMEOUT = false;               // true para seguridad en operacion, false para ajuste en banco
// ── Umbrales LQR ─────────────────────────────────────────────────────────────
const unsigned long LQR_FALLBACK_TIME_MS = 500;          // Tiempo fuera de vertical antes de fallback (era 1000)
const float LQR_FALLBACK_ALPHA_DEG = 45.0f;              // |α| mínimo para iniciar fallback (subido de 30 para dar más tiempo al LQR)
const float LQR_REARM_ALPHA_DEG = 60.0f;                 // |α| por debajo del cual se re-arma la transición
const float LQR_SERVO_LIMIT_DEG = 90.0f;                 // Saturación del ángulo del servo en el lazo
const float LQR_HARDSTOP_DEG = 120.0f;                   // |θ| por encima del cual se fuerza PWM máxima hacia el centro
const float LQR_PROTECT_ALPHA_DEG = 140.0f;              // |α| por encima del cual LQR apaga el motor (cerca del fondo)

// ── Umbrales PID Servo (modo 2) ──────────────────────────────────────────────
const float PID_ANTIWIND_ERR_DEG = 45.0f;               // |err| máx. para integrar (anti-windup)
const float PID_ANTIWIND_VEL_DPS = 60.0f;               // |vel| máx. para integrar (anti-windup)
const float DEADBAND_FINE_DEG = 0.5f;                   // Dead band modo fino
const float DEADBAND_COARSE_DEG = 1.0f;                 // Dead band modo grueso
const float DEADBAND_CLASSIC_DEG = 0.8f;                // Dead band PID clásico
const float STICTION_ERR_THRESH_DEG = 8.0f;              // |err| mín. para aplicar kick de fricción
const float STICTION_VEL_THRESH_DPS = 15.0f;            // |vel| máx. para aplicar kick de fricción
const float PWM_LIMIT_FINE_NEAR_DEG = 5.0f;             // Cerca del setpoint (modo fino)
const float PWM_LIMIT_FINE_MID_DEG = 10.0f;             // Medio (modo fino)
const int PWM_LIMIT_FINE_NEAR = 30;
const int PWM_LIMIT_FINE_MID = 50;
const int PWM_LIMIT_COARSE_NEAR = 80;                   // PWM máx. si |err| < 20° (modo grueso)
const float PWM_LIMIT_COARSE_NEAR_DEG = 20.0f;
const int PWM_LIMIT_CLASSIC_NEAR = 35;
const int PWM_LIMIT_CLASSIC_MID = 55;
const int PWM_LIMIT_CLASSIC_FAR = 80;

// ── INA219 watchdog ───────────────────────────────────────────────────────────
const unsigned long INA_WATCHDOG_PERIOD_MS = 1000;       // Periodo del watchdog I2C
const unsigned long INA_INIT_RETRY_MS = 5000;            // Periodo de reintento de init

// ── Umbrales swing-up (modo 5) ────────────────────────────────────────────────
const float SWINGUP_TRANSITION_VEL_DPS = 30.0f;          // Velocidad angular máx. para transicionar a LQR (subido de 15)
const float SWINGUP_KICK_DUTY_FRAC = 0.7f;               // Amplitud del kick inicial (% de PWM_MAX)
const unsigned long SWINGUP_KICK_PERIOD_MS = 450;         // Semi-periodo del kick (~frecuencia natural del péndulo)
const float SWINGUP_QUIET_THRESHOLD_RADPS = 0.15f;       // |α̇| por debajo del cual se aplica kick alternante
const float SWINGUP_PROD_DEADZONE = 0.001f;              // Dead-zone para sign(α̇·cos α)

unsigned long lastControlUs = 0;
unsigned long lastTelemetryMs = 0;
unsigned long lastCommandMs = 0;

// ── WiFi Configuration (stored in NVS/Preferences) ──────────────────────────
Preferences preferences;
const char* AP_SSID = "QUBE-ESP32";
const char* AP_PASS = "qube1234";
const bool ENABLE_STA = true;  // true: conecta tambien a tu router LAN
char staSsid[33] = "";         // Max 32 chars + null
char staPass[65] = "";         // Max 64 chars + null
const unsigned long WIFI_CONNECT_TIMEOUT_MS = 15000;
AsyncWebServer server(80);
AsyncWebSocket ws("/ws");
INA219_WE ina219(&Wire, 0x40);
bool inaOk = false;
uint8_t inaAddr = 0x40;
float busVoltageV = 0.0f;
float shuntVoltagemV = 0.0f;
float currentmA = 0.0f;
float powermW = 0.0f;

void scanI2CBus() {
  Serial.println("I2C scan: inicio");
  int found = 0;
  for (uint8_t addr = 1; addr < 127; addr++) {
    Wire.beginTransmission(addr);
    const uint8_t err = Wire.endTransmission();
    if (err == 0) {
      Serial.print("I2C dispositivo @ 0x");
      if (addr < 16) {
        Serial.print("0");
      }
      Serial.println(addr, HEX);
      found++;
    }
  }
  if (found == 0) {
    Serial.println("I2C scan: sin dispositivos");
  }
}

bool initIna219() {
  const uint8_t candidates[] = {0x40, 0x41, 0x44, 0x45};
  for (size_t i = 0; i < (sizeof(candidates) / sizeof(candidates[0])); i++) {
    const uint8_t addr = candidates[i];
    Wire.beginTransmission(addr);
    if (Wire.endTransmission() != 0) {
      continue;
    }

    ina219 = INA219_WE(&Wire, addr);
    if (ina219.init()) {
      ina219.setMeasureMode(INA219_CONTINUOUS);
      inaAddr = addr;
      return true;
    }
  }
  return false;
}
// ══════════════════════════════════════════════════════════════════════════════
// PCNT (Pulse Counter) — decodificación de encoder en hardware
// Cuenta cada transición de GPIO sin intervención de CPU.
// X4 cuadratura: 4 conteos por ciclo eléctrico completo.
// ══════════════════════════════════════════════════════════════════════════════

static pcnt_unit_t pcnt_servo_unit = PCNT_UNIT_0;
static pcnt_unit_t pcnt_pendulum_unit = PCNT_UNIT_1;

void initPcntUnit(pcnt_unit_t unit, int pinA, int pinB) {
  // Channel 0: pulse=A, ctrl=B — X4 cuadratura
  pcnt_config_t ch0 = {
    .pulse_gpio_num = (gpio_num_t)pinA,
    .ctrl_gpio_num = (gpio_num_t)pinB,
    .lctrl_mode = PCNT_MODE_KEEP,    // B=0 → mantener dirección
    .hctrl_mode = PCNT_MODE_REVERSE, // B=1 → invertir dirección
    .pos_mode = PCNT_COUNT_INC,      // A↑ → +1 por defecto
    .neg_mode = PCNT_COUNT_DEC,      // A↓ → -1 por defecto
    .counter_h_lim = 32767,
    .counter_l_lim = -32768,
    .unit = unit,
    .channel = PCNT_CHANNEL_0,
  };
  pcnt_unit_config(&ch0);

  // Channel 1: pulse=B, ctrl=A — X4 cuadratura
  pcnt_config_t ch1 = {
    .pulse_gpio_num = (gpio_num_t)pinB,
    .ctrl_gpio_num = (gpio_num_t)pinA,
    .lctrl_mode = PCNT_MODE_REVERSE, // A=0 → invertir dirección
    .hctrl_mode = PCNT_MODE_KEEP,    // A=1 → mantener dirección
    .pos_mode = PCNT_COUNT_INC,      // B↑ → +1 por defecto
    .neg_mode = PCNT_COUNT_DEC,      // B↓ → -1 por defecto
    .counter_h_lim = 32767,
    .counter_l_lim = -32768,
    .unit = unit,
    .channel = PCNT_CHANNEL_1,
  };
  pcnt_unit_config(&ch1);

  pcnt_counter_pause(unit);
  pcnt_counter_clear(unit);
  pcnt_counter_resume(unit);
}

long readPcnt(pcnt_unit_t unit) {
  int16_t count = 0;
  pcnt_get_counter_value(unit, &count);
  return (long)count;
}

void resetPcnt(pcnt_unit_t unit) {
  pcnt_counter_pause(unit);
  pcnt_counter_clear(unit);
  pcnt_counter_resume(unit);
}

long getPendulumCountAtomic() {
  return readPcnt(pcnt_pendulum_unit);
}

float getPendulumDegPerCount() {
  if (pendCountsPerRev < 1.0f) {
    pendCountsPerRev = 1.0f;
  }
  return 360.0f / pendCountsPerRev;
}

float getPendulumRawPositionDeg() {
  return pendulumDir * getPendulumCountAtomic() * getPendulumDegPerCount();
}

float getPendulumPositionDeg() {
  return getPendulumRawPositionDeg() - pendulumOffsetDeg;
}

void zeroPendulumHere() {
  pendulumOffsetDeg = getPendulumRawPositionDeg();
}


void resetLqr() {
  lqr_prevTheta = getPositionDeg();
  lqr_prevAlpha = getPendulumPositionDeg();
  lqr_filteredVelTheta = 0.0f;
  lqr_filteredVelAlpha = 0.0f;
  kalmanReset();
}
// Normaliza ángulo a [-180, 180]
float normalizeAngle(float deg) {
  deg = fmodf(deg, 360.0f);
  if (deg > 180.0f) deg -= 360.0f;
  else if (deg < -180.0f) deg += 360.0f;
  return deg;
}

long getEncoderCountAtomic() {
  return readPcnt(pcnt_servo_unit);
}

float getDegPerCount() {
  if (countsPerRev < 1.0f) {
    countsPerRev = 1.0f;
  }
  return 360.0f / countsPerRev;
}

float getRawPositionDeg() {
  return encoderDir * getEncoderCountAtomic() * getDegPerCount();
}

float getPositionDeg() {
  return getRawPositionDeg() - positionOffsetDeg;
}

