abt-st/FIRMWARE-UPDATE-QUBE-ESP32/src/firmware/esp32_qube/esp32_qube.ino
void zeroPositionHere() {
  positionOffsetDeg = getRawPositionDeg();
}

void resetPid() {
  integralTerm = 0.0f;
  prevPos = getPositionDeg();
  filteredVel = 0.0f;
}
void setMotor(int pwmValue) {
  // Soft saturation: reducir PWM gradualmente cerca de los límites mecánicos del servo.
  // Factor = 1 / (1 + (|pos|/k)^y), con k=120° (umbral BTS7960) y y=2 (agresividad).
  // En pos=0: factor=1.0. En pos=60°: factor=0.80. En pos=90°: factor=0.64.
  float pos_factor = 1.0f / (1.0f + powf(fabsf(lastServoPos) / 200.0f, 2.0f));
  pwmValue = (int)(pwmValue * pos_factor);
  pwmValue = constrain(pwmValue, -255, 255);
  lastPwmCmd = pwmValue;

  if (USE_ENA_PWM) {
    if (pwmValue > 0) {
      digitalWrite(PIN_IN1, HIGH);
      digitalWrite(PIN_IN2, LOW);
      pwmWriteCompat(PIN_ENA, PWM_CH_ENA, pwmValue);
      return;
    }

    if (pwmValue < 0) {
      digitalWrite(PIN_IN1, LOW);
      digitalWrite(PIN_IN2, HIGH);
      pwmWriteCompat(PIN_ENA, PWM_CH_ENA, -pwmValue);
      return;
    }

    digitalWrite(PIN_IN1, LOW);
    digitalWrite(PIN_IN2, LOW);
    pwmWriteCompat(PIN_ENA, PWM_CH_ENA, 0);
    return;
  }

  if (pwmValue > 0) {
    pwmWriteCompat(PIN_IN1, PWM_CH_IN1, pwmValue);
    pwmWriteCompat(PIN_IN2, PWM_CH_IN2, 0);
    return;
  }

  if (pwmValue < 0) {
    pwmWriteCompat(PIN_IN1, PWM_CH_IN1, 0);
    pwmWriteCompat(PIN_IN2, PWM_CH_IN2, -pwmValue);
    return;
  }

  // pwmValue == 0: ambos INx a 0

  pwmWriteCompat(PIN_IN1, PWM_CH_IN1, 0);
  pwmWriteCompat(PIN_IN2, PWM_CH_IN2, 0);
}
// setMotorDirect: como setMotor pero SIN soft saturation. Para frenado de emergencia.
void setMotorDirect(int pwmValue) {
  pwmValue = constrain(pwmValue, -255, 255);
  lastPwmCmd = pwmValue;
  if (USE_ENA_PWM) {
    if (pwmValue > 0) { digitalWrite(PIN_IN1, HIGH); digitalWrite(PIN_IN2, LOW); pwmWriteCompat(PIN_ENA, PWM_CH_ENA, pwmValue); return; }
    if (pwmValue < 0) { digitalWrite(PIN_IN1, LOW); digitalWrite(PIN_IN2, HIGH); pwmWriteCompat(PIN_ENA, PWM_CH_ENA, -pwmValue); return; }
    digitalWrite(PIN_IN1, LOW); digitalWrite(PIN_IN2, LOW); pwmWriteCompat(PIN_ENA, PWM_CH_ENA, 0); return;
  }
  if (pwmValue > 0) { pwmWriteCompat(PIN_IN1, PWM_CH_IN1, pwmValue); pwmWriteCompat(PIN_IN2, PWM_CH_IN2, 0); return; }
  if (pwmValue < 0) { pwmWriteCompat(PIN_IN1, PWM_CH_IN1, 0); pwmWriteCompat(PIN_IN2, PWM_CH_IN2, -pwmValue); return; }
  pwmWriteCompat(PIN_IN1, PWM_CH_IN1, 0); pwmWriteCompat(PIN_IN2, PWM_CH_IN2, 0);
}
// brakeMotor: frenado ACTIVO (ambos H-bridge HIGH = cortocircuito del motor).
// Detiene el servo mucho más rápido que coast (PWM=0).
void brakeMotor() {
  if (USE_ENA_PWM) {
    digitalWrite(PIN_IN1, HIGH);
    digitalWrite(PIN_IN2, HIGH);
    pwmWriteCompat(PIN_ENA, PWM_CH_ENA, 255);
    Serial.println("[BRAKE] ENA brake");
    return;
  }
  Serial.printf("[BRAKE] IN1=255 IN2=255 sv=%.1f\n", getRawPositionDeg());
  pwmWriteCompat(PIN_IN1, PWM_CH_IN1, 255);
  pwmWriteCompat(PIN_IN2, PWM_CH_IN2, 255);
}


void setMode(int newMode) {
  // Punto único de cambio de modo. Usado por HTTP y Serial para garantizar
  // que las mismas rutinas de reset y flags se ejecuten siempre.
  if (newMode < 0 || newMode > 7) return;
  mode = newMode;
  swing_recovering = false;  // Reset recovery state al cambiar de modo
  resetPid();
  if (mode == 4) {
    resetLqr();
    lqr_inFallback = false;
    lqr_fallbackMs = 0;
    spinCooldownMs = 0;  // Reset cooldown anti-spin para no interferir con LQR
  }
  if (mode == 0) {
    setMotor(0);
    lqr_inFallback = false;
  }
  if (mode == 5) {
    swing_filteredVelAlpha = 0.0f;
    swing_predictedVelAlpha = 0.0f;  // Reset complementary filter
    prev_alpha_dot_peak = 0.0f;  // Reset peak detection
    swing_maxAngleAchieved = 0.0f;  // Reset adaptive ke_gain
    swing_lastImprovementMs = millis();
    // Solo reset ke_gain si no fue configurado por HTTP
    // (ke_gain fue seteado por cmd?ke= antes de cmd?m=5)
  }
  if (mode == 6) {
    rlAction = 0.0f;
    lqr_prevTheta = getPositionDeg();
    lqr_prevAlpha = getPendulumPositionDeg();
    lqr_filteredVelTheta = 0.0f;
    lqr_filteredVelAlpha = 0.0f;
  }
  if (mode == 7) {
    // Reset RL inference buffer
    rl_obs_idx = 0;
    rl_last_action = 0.0f;
    memset(rl_obs_buf, 0, sizeof(rl_obs_buf));
    lqr_prevTheta = getPositionDeg();
    lqr_prevAlpha = getPendulumPositionDeg();
    lqr_filteredVelTheta = 0.0f;
    lqr_filteredVelAlpha = 0.0f;
  }
}

void safeStop() {
  setMode(0);
}

// Watchdog del INA219: cada WATCHDOG_PERIOD_MS verificamos que el sensor
// sigue respondiendo en I2C. Si falla, marcamos inaOk=false y reintentamos
// la inicialización con la lista de direcciones candidatas.
static unsigned long lastInaWatchdogMs = 0;
void updateIna219() {
  const unsigned long nowMs = millis();
  if (inaOk && (nowMs - lastInaWatchdogMs) >= INA_WATCHDOG_PERIOD_MS) {
    lastInaWatchdogMs = nowMs;
    // ACK-poll: si el dispositivo no responde, endTransmission() != 0.
    Wire.beginTransmission(inaAddr);
    if (Wire.endTransmission() != 0) {
      inaOk = false;
      Serial.println("[INA219] Watchdog: sensor no responde, reintentando…");
    }
  }
  if (!inaOk) {
    // Reintentar inicialización cada WATCHDOG_PERIOD_MS
    if (nowMs - lastInaWatchdogMs == 0 || (nowMs - lastInaWatchdogMs) >= INA_WATCHDOG_PERIOD_MS) {
      inaOk = initIna219();
      if (inaOk) Serial.println("[INA219] Re-inicializado OK");
    }
    return;
  }
  shuntVoltagemV = ina219.getShuntVoltage_mV();
  busVoltageV = ina219.getBusVoltage_V();
  currentmA = ina219.getCurrent_mA();
  powermW = ina219.getBusPower();
}

String getStateJson() {
  updateIna219();
  // Servo encoder
  const long c = getEncoderCountAtomic();
  const int encA = digitalRead(PIN_ENC_A);
  const int encB = digitalRead(PIN_ENC_B);
  const float rawPos = encoderDir * c * getDegPerCount();
  const float pos = rawPos - positionOffsetDeg;
  const float err = setpoint_deg - pos;

  // Pendulum encoder
  const long pc = getPendulumCountAtomic();
  const float rawPendPos = pendulumDir * pc * getPendulumDegPerCount();
  const float pendPos = rawPendPos - pendulumOffsetDeg;
  // (pendulum setpoint/error removed — no PID pendulum)

  String json = "{";
  json += "\"mode\":" + String(mode) + ",";
  // Servo
  json += "\"count\":" + String(c) + ",";
  json += "\"enc_a\":" + String(encA) + ",";
  json += "\"enc_b\":" + String(encB) + ",";
  json += "\"encoder_dir\":" + String(encoderDir) + ",";
  json += "\"counts_per_rev\":" + String(countsPerRev, 3) + ",";
  json += "\"raw_position_deg\":" + String(rawPos, 3) + ",";
  json += "\"position_deg\":" + String(pos, 3) + ",";
  json += "\"offset_deg\":" + String(positionOffsetDeg, 3) + ",";
  json += "\"setpoint_deg\":" + String(setpoint_deg, 3) + ",";
  json += "\"error_deg\":" + String(err, 3) + ",";
  // Pendulum
  json += "\"pend_count\":" + String(pc) + ",";
  json += "\"pend_raw_position_deg\":" + String(rawPendPos, 3) + ",";
  json += "\"pend_position_deg\":" + String(pendPos, 3) + ",";
  json += "\"pend_offset_deg\":" + String(pendulumOffsetDeg, 3) + ",";
  // Motor & power
  json += "\"pwm\":" + String(lastPwmCmd) + ",";
  json += "\"gain_scheduling\":" + String(useGainScheduling ? "true" : "false") + ",";
  json += "\"gain_mode\":" + String(gainMode) + ",";
  json += "\"ina_ok\":" + String(inaOk ? "true" : "false") + ",";
  json += "\"v_bus\":" + String(busVoltageV, 3) + ",";
  json += "\"v_shunt_mv\":" + String(shuntVoltagemV, 3) + ",";
  json += "\"i_ma\":" + String(currentmA, 3) + ",";
  json += "\"p_mw\":" + String(powermW, 3) + ",";
  json += "\"servo_ff_pwm\":" + String(servo_ff_pwm, 1) + ",";
  json += "\"vel_alpha\":" + String(velAlpha, 3) + ",";
  json += "\"kf_enabled\":" + String(kf_enabled ? "true" : "false") + ",";
  json += "\"kf_theta\":" + String(kf_x[0], 3) + ",";
  json += "\"kf_alpha\":" + String(kf_x[1], 3) + ",";
  json += "\"kf_dtheta\":" + String(kf_x[2], 2) + ",";
  json += "\"kf_dalpha\":" + String(kf_x[3], 2);
  json += "}";
  return json;
}

