abt-st/FIRMWARE-UPDATE-QUBE-ESP32/src/firmware/esp32_qube/esp32_qube.ino
      // LQR: u = -(K1*theta + K2*alpha + K3*theta_dot + K4*alpha_dot)
      // alpha=0 es la posición vertical (invertido)
      float u = -(lqr_K1 * theta + k2_eff * alpha + lqr_K3 * velTheta_ctrl + k4_eff * velAlpha_ctrl);

      // Energy dissipation dentro de LQR: agregar término de amortiguamiento
      // proporcional a la velocidad angular del péndulo. Esto reduce el ciclo
      // límite alrededor de ±180° sin afectar la estabilidad del LQR.
      if (abs(alpha) < LQR_NEAR_DEG) {
        u -= LQR_DAMPING_GAIN * velAlpha_ctrl;
      }

      pwm = constrain((int)(MOTOR_DIR * u), -70, 70);

      // Servo centering en LQR: mantener el servo cerca del centro para
      // maximizar el rango de actuación y reducir oscilación del servo.
      // Centering agresivo: si el servo se aleja del centro, la fuerza de
      // retorno crece linealmente. Esto previene que el servo pegue contra
      // el stop mecánico y cause brownout.
      {
        // Centering: solo activo 2+ segundos después del catch.
        // Durante los primeros 2s, el LQR necesita control total del servo
        // para estabilizar el péndulo sin interferencia del centering.
        float centering_sec = (millis() - lqr_catchMs) / 1000.0f;
        if (centering_sec > 2.0f) {
          float absTheta = fabsf(theta);
          // Ramp: centering crece gradualmente de 0 a full en 2s adicionales
          float ramp = constrain((centering_sec - 2.0f) / 2.0f, 0.0f, 1.0f);
          float centering_gain = 0.5f * ramp;
          if (absTheta > 40.0f) centering_gain = 1.0f * ramp;
          else if (absTheta > 20.0f) centering_gain = 0.75f * ramp;
          float centering = -centering_gain * theta;
          centering = constrain(centering, -25.0f, 25.0f);
          pwm += (int)centering;
        }
      }

      // Límite de PWM del servo en LQR.
      // CRITICO: solo forzar centering cuando el péndulo NO está cerca
      // de la vertical. Si el péndulo está arriba, el LQR necesita
      // control completo del servo para mantener el equilibrio.
      {
        float absAlpha = fabsf(alpha);
        float absTheta = fabsf(theta);
        bool pendulumNearVertical = (absAlpha < 30.0f);  // alpha≈0 = vertical arriba
        int servoPwmLimit = 70;

        if (absTheta > 70.0f && !pendulumNearVertical) {
          // FORZAR centro solo cuando el péndulo NO está arriba.
          // Cuando el péndulo está en la vertical, dejar al LQR decidir.
          float center_dir = (theta > 0) ? -1.0f : 1.0f;
          pwm = (int)(center_dir * 70.0f);
          servoPwmLimit = 70;
        } else if (absTheta > 70.0f && pendulumNearVertical) {
          // Péndulo arriba + servo lejos: limitar PWM que se ALEJA del centro,
          // pero permitir PWM que va AL centro. No reemplazar el output del LQR.
          float stop_dir = (theta > 0) ? 1.0f : -1.0f;
          float pwm_dir = (pwm > 0) ? 1.0f : ((pwm < 0) ? -1.0f : 0.0f);
          if (pwm_dir == stop_dir) {
            // PWM va contra stop: limitar fuertemente
            servoPwmLimit = 30;
          } else {
            // PWM va al centro: permitir hasta 70
            servoPwmLimit = 70;
          }
        } else if (absTheta > 50.0f) {
          // Región transicional: limitar PWM que se aleja
          float stop_dir = (theta > 0) ? 1.0f : -1.0f;
          float pwm_dir = (pwm > 0) ? 1.0f : ((pwm < 0) ? -1.0f : 0.0f);
          if (pwm_dir == stop_dir) {
            servoPwmLimit = (int)(70.0f - (absTheta - 50.0f) * (70.0f / 20.0f));
            servoPwmLimit = constrain(servoPwmLimit, 10, 70);
          }
        }
        pwm = constrain(pwm, -servoPwmLimit, servoPwmLimit);
      }

      // Protección: apagar motor si el péndulo acumuló rotación (raw>250°).
      // Usar raw en vez de alpha (wrapped) que cruza ±180° discontinuamente.
      if (fabsf(pendPosRaw) > 250.0f) {
        pwm = 0;
      }

      // Fallback: si raw>360°, el péndulo hizo una vuelta → LQR falló.
      // Fallback inmediato + reset offset para que swing-up arranque limpio.
      if (fabsf(pendPosRaw) > 360.0f) {
        if (!lqr_inFallback) {
          pendulumOffsetDeg = pendulumDir * getPendulumCountAtomic() * getPendulumDegPerCount();
          prevPosPend = 0.0f;
          pendPosRawPrev = 0.0f;
          setMode(5);
          lqr_inFallback = true;
          Serial.printf("LQR: FALLBACK (raw=%.1f, offset reset)\n", pendPosRaw);
        }
      } else if (fabsf(pendPosRaw) < 45.0f) {
        // Rearm: péndulo cerca del fondo, listo para nuevo intento
        lqr_fallbackMs = 0;
        lqr_inFallback = false;
      }

      // HARD CLAMP: cuando |pos| > 100°, solo permitir PWM hacia centro.
      // NO override si el PWM ya va al centro (forced centering lo hace).
      if (fabsf(pos) > 100.0f) {
        float stop_dir = (pos > 0) ? 1.0f : -1.0f;
        float pwm_dir = (pwm > 0) ? 1.0f : ((pwm < 0) ? -1.0f : 0.0f);
        if (pwm_dir == stop_dir) {
          pwm = (int)(stop_dir * -30.0f);  // Solo cortar si va contra stop
        }
        // Si va al centro → permitir sin cambio
      } else if (fabsf(pos) > 85.0f) {
        // Direction-aware: solo cortar PWM que empuja contra el stop.
        // PWM que va AL centro se permite SIN reducción.
        float stop_dir = (pos > 0) ? 1.0f : -1.0f;
        float pwm_dir = (pwm > 0) ? 1.0f : ((pwm < 0) ? -1.0f : 0.0f);
        if (pwm_dir == stop_dir) {
          pwm = 0;  // Empuja contra stop → cortar
        }
        // Si va al centro → permitir sin restricción (para recuperar)
      } else if (fabsf(pos) > 70.0f) {
        // Cortar solo el PWM que empuja hacia el stop (direction-aware)
        float stop_dir = (pos > 0) ? 1.0f : -1.0f;
        float pwm_dir = (pwm > 0) ? 1.0f : ((pwm < 0) ? -1.0f : 0.0f);
        if (pwm_dir == stop_dir) {
          float factor = 1.0f - (fabsf(pos) - 70.0f) / 15.0f;
          pwm = (int)(pwm * constrain(factor, 0.0f, 1.0f));
        }
      }
      // ── Voltage-based brownout protection (LQR) ───────────────────────
      if (inaOk && busVoltageV > 0.1f) {
        if (busVoltageV < 12.5f) {
          pwm = 0;
          setMotor(0);
          return;
        } else if (busVoltageV < 13.5f) {
          float factor = (busVoltageV - 12.5f) / 1.0f;
          pwm = (int)(pwm * constrain(factor, 0.3f, 1.0f));
        }
      }
      pwm = constrain(pwm, -PWM_MAX, PWM_MAX);
      setMotor(pwm);

    } else if (mode == 5) {
    // ══════════════════════════════════════════════════════════════════════════
    // MODO 5: Swing-up por energia con kick continuo
      int pwm = 0;
      // ── HARD SAFETY: frenar si servo > 85° (prevenir atasco) ──────
      {
        if (fabsf(pos) > 90.0f) {
          float brake_dir = (pos > 0) ? -1.0f : 1.0f;
          setMotor((int)(brake_dir * 70.0f));
          return;
        }
      }
      swing_predictedVelAlpha = swing_filteredVelAlpha;  // Sync prediction with blended result
      const float alpha_dot = swing_filteredVelAlpha;  // Filtrado para energy pumping
      prevPosPend = pendPosRaw;

      // ── Detección de spinning ──────────────────────────────────────────
      // Si el péndulo acumula >360° en crudo entre samples, está girando.
      float rawDelta = fabsf(pendPosRaw - pendPosRawPrev);
      bool spinning = (rawDelta > 200.0f);  // >200° entre samples = spinning rápido
      pendPosRawPrev = pendPosRaw;

      // Contador de vueltas: si |pendPosRaw| > 360° (1 vuelta), forzar frenado
      if (fabsf(pendPosRaw) > 360.0f) spinning = true;

      const float mgl = PEND_MASS * GRAVITY * PEND_LENGTH;

      // Cooldown post-spin: aplicar freno durante SPIN_COOLDOWN_MS después de detectar spinning
      bool inCooldown = (spinCooldownMs > 0) && ((millis() - spinCooldownMs) < SPIN_COOLDOWN_MS);

      if (spinning || inCooldown) {
        // ── Anti-spin: freno máximo + reset offset ──────────────────────
        if (spinning) {
          // Reset offset INMEDIATAMENTE para que pendPos refleje posición real
          pendulumOffsetDeg = pendulumDir * getPendulumCountAtomic() * getPendulumDegPerCount();
          prevPosPend = 0.0f;
          pendPosRawPrev = 0.0f;
          swing_filteredVelAlpha = 0.0f;
          spinCooldownMs = millis();  // Iniciar cooldown
          Serial.printf("Swing-up: SPIN detected, raw=%.1f, braking + cooldown\n", pendPosRaw);
        }

        // Freno máximo (durante todo el cooldown)
        int brake_pwm = (alpha_dot > 0.0f) ? -PWM_MAX : PWM_MAX;
        pwm = brake_pwm;
      } else {
        // ══════════════════════════════════════════════════════════════════
        // TRANSICION A LQR: solo cuando el péndulo está cerca de la vertical.
        // Transicion a LQR cuando el pendulo esta dentro de ±60° de vertical.
        // Vertical = |pendPos| ≈ 180°. ±60° = |pendPos| > 120°.
        // ══════════════════════════════════════════════════════════════════
        float vel_raw_dps = fabsf(alpha_dot) * RAD_TO_DEG;
        bool nearVertical = fabsf(pendPos) > 120.0f;
        bool verySlow = vel_raw_dps < 30.0f;
        bool canTransition = nearVertical && verySlow;

        // Peak detection: detect position peak (alpha_dot crosses zero)
        bool atPeak = (prev_alpha_dot_peak > 0.0f && alpha_dot <= 0.0f) ||
                       (prev_alpha_dot_peak < 0.0f && alpha_dot >= 0.0f);
        prev_alpha_dot_peak = alpha_dot;

        // At position peak AND near vertical
        bool atPeakTransition = atPeak && (180.0f - fabsf(pendPos) < 60.0f);

