abt-st/FIRMWARE-UPDATE-QUBE-ESP32/src/firmware/esp32_qube/esp32_qube.ino
        // FORCED transition
        bool forcedTransition = fabsf(pendPos) > 125.0f;

        // Energy-based
        const float mgl_eb = PEND_MASS * GRAVITY * PEND_LENGTH;
        const float alpha_eb_rad = pendPosRaw * DEG_TO_RAD;
        float E_current = 0.5f * PEND_INERTIA * alpha_dot * alpha_dot +
                          mgl_eb * (1.0f - cosf(alpha_eb_rad));
        float E_target_eb = 2.0f * mgl_eb;
        bool energyReady = (E_target_eb > 0.0f) &&
                           (fabsf(E_current - E_target_eb) / E_target_eb < 0.10f) &&
                           fabsf(pendPos) > 120.0f &&
                           (vel_raw_dps < 60.0f);


        if (canTransition || atPeakTransition || forcedTransition || energyReady) {
          setMode(4);
          lqr_inFallback = false;
          lqr_catchMs = millis();
          spinCooldownMs = 0;
          Serial.printf("LQR TRANS (pend=%.1f vel=%.1f peak=%d forced=%d energy=%.3f raw=%.1f)\n", pendPos, vel_raw_dps, atPeakTransition, forcedTransition, E_current / E_target_eb, pendPosRaw);
          pwm = 0;
          setMotor(pwm);
          return;
        }

        // ── Recovery: péndulo cruzó la vertical sin transicionar ───────
        if (swing_recovering) {
          // Recovery con frenado proporcional a velocidad (preserva algo de energía)
          float recover_brake = -0.4f * alpha_dot;  // Frenado proporcional
          pwm = constrain((int)(MOTOR_DIR * recover_brake * swingupPwmMax), -swingupPwmMax, swingupPwmMax);
          if (fabsf(pendPos) < SWING_RECOVERY_THRESHOLD) {
            swing_recovering = false;
            // Reset offset al salir de recovery para que raw esté en [-180,180]
            pendulumOffsetDeg = pendulumDir * getPendulumCountAtomic() * getPendulumDegPerCount();
            prevPosPend = 0.0f;
            pendPosRawPrev = 0.0f;
            swing_filteredVelAlpha = 0.0f;
            swing_predictedVelAlpha = 0.0f;
            Serial.printf("Swing-up: recovery COMPLETE (pend=%.1f)\n", pendPos);
          }
        } else if (fabsf(pendPosRaw) > 180.0f) {
          // El péndulo cruzó la vertical sin transicionar → recovery.
          // Reset offset para que raw se mantenga acotado.
          swing_recovering = true;
          pendulumOffsetDeg = pendulumDir * getPendulumCountAtomic() * getPendulumDegPerCount();
          prevPosPend = 0.0f;
          pendPosRawPrev = 0.0f;
          swing_filteredVelAlpha = 0.0f;
          swing_predictedVelAlpha = 0.0f;
          Serial.printf("Swing-up: RECOVERY START (raw=%.1f, pend=%.1f, vel=%.1f)\n", pendPosRaw, pendPos, vel_raw_dps);
        } else if (fabsf(pendPosRaw) > 165.0f) {
          // ── Damping: disipar energía desde 165° hasta la vertical ──
          float dampStrength = (fabsf(pendPosRaw) - 165.0f) / 15.0f;
          dampStrength = constrain(dampStrength, 0.0f, 1.0f);
          float damping = -(0.3f + 0.7f * dampStrength) * alpha_dot;
          pwm = constrain((int)(MOTOR_DIR * damping * swingupPwmMax), -swingupPwmMax, swingupPwmMax);
        } else {
          // ── Resonant pumping: servo oscila a frecuencia del péndulo ────
          if (fabsf(alpha_dot) < SWINGUP_QUIET_THRESHOLD_RADPS) {
            // Péndulo quieto: kick sinusoidal para iniciar oscilación
            float t_sec = millis() / 1000.0f;
            float kick_ref = 40.0f * sinf(2.0f * PI * 2.0f * t_sec);
            float error = kick_ref - pos;
            pwm = (int)(MOTOR_DIR * error * 3.0f);
            pwm = constrain(pwm, -swingupPwmMax, swingupPwmMax);
          } else {
            // Péndulo oscilando: resonant pumping
            float pump_ref = alpha_dot * 120.0f;
            pump_ref = constrain(pump_ref, -70.0f, 70.0f);  // ±70° (hard safety a 85° protege)
            // Adaptive gain: boost when pendulum stalls
            float currentAbsAngle = fabsf(pendPos);
            if (currentAbsAngle > swing_maxAngleAchieved + 5.0f) {
              swing_maxAngleAchieved = currentAbsAngle;
              swing_lastImprovementMs = millis();
              ke_gain = KE_GAIN_BASE;
            } else if ((millis() - swing_lastImprovementMs) > STALL_TIMEOUT_MS) {
              ke_gain = KE_GAIN_BOOST;
            }

            float error = pump_ref - pos;
            float Kp_pump = ke_gain * 4.0f;
            pwm = (int)(MOTOR_DIR * error * Kp_pump);
            pwm = constrain(pwm, -swingupPwmMax, swingupPwmMax);
          }
        }
      }

      // ── Voltage-based brownout protection ──────────────────────────────
      // Read INA219 voltage (updated at telemetry rate, ~100ms)
      // If v_bus drops, reduce PWM proportionally to prevent brownout.
      // Normal: ~14.8V. Brownout threshold: ~12.5V (ESP32 minimum ~3.0V on 5V rail).
      if (inaOk && busVoltageV > 0.1f) {
        if (busVoltageV < 12.5f) {
          // Critical: motor stalled against hard stop → cut completely
          pwm = 0;
          setMotor(0);
          return;
        } else if (busVoltageV < 13.5f) {
          // Warning: reduce PWM to 50% to prevent further drop
          float factor = (busVoltageV - 12.5f) / 1.0f;  // 0.0 at 12.5V, 1.0 at 13.5V
          pwm = (int)(pwm * constrain(factor, 0.3f, 1.0f));
        }
      }

      pwm = constrain(pwm, -PWM_MAX, PWM_MAX);
      setMotor(pwm);
    } else if (mode == 6) {
    // ══════════════════════════════════════════════════════════════════════════
    // MODO 6: Deep RL — recibe acción por HTTP, aplica PWM directo
    // Endpoints: GET /rl_state (obs), GET /rl_cmd?a=X (action)
    // ══════════════════════════════════════════════════════════════════════════
      // Safety: brake if servo out of range
      if (fabsf(pos) > 90.0f) {
        float brake_dir = (pos > 0) ? -1.0f : 1.0f;
        setMotor((int)(brake_dir * 70.0f));
        return;
      }

      // Compute velocities (same EMA filter as LQR — degrees internally)
      const float theta_rl = pos;
      const float alpha_rl_raw = pendPosRaw;
      const float rawVelTheta_rl = -(theta_rl - lqr_prevTheta) / dt;
      const float rawVelAlpha_rl = -(alpha_rl_raw - lqr_prevAlpha) / dt;
      lqr_filteredVelTheta = velAlpha * rawVelTheta_rl + (1.0f - velAlpha) * lqr_filteredVelTheta;
      lqr_filteredVelAlpha = VEL_ALPHA_PEND * rawVelAlpha_rl + (1.0f - VEL_ALPHA_PEND) * lqr_filteredVelAlpha;
      lqr_prevTheta = theta_rl;
      lqr_prevAlpha = alpha_rl_raw;

      // Apply RL action as PWM
      int rl_pwm = (int)(rlAction * PWM_MAX);
      rl_pwm = constrain(rl_pwm, -PWM_MAX, PWM_MAX);
      setMotor(rl_pwm);
    } else if (mode == 7) {
    // ══════════════════════════════════════════════════════════════════════════
    // MODO 7: On-device RL inference — forward pass en ESP32
    // Red entrenada: [36→64→64→1] ReLU, Hardtanh(-2,2)
    // Observación: 4 pasos × [θ, α, cosθ, sinθ, cosα, sinα, θ̇, α̇, action]
    // ══════════════════════════════════════════════════════════════════════════
      // Safety: brake if servo out of range
      if (fabsf(pos) > 90.0f) {
        float brake_dir = (pos > 0) ? -1.0f : 1.0f;
        setMotor((int)(brake_dir * 70.0f));
        return;
      }

      // Compute velocities (EMA filter — same as mode 6)
      const float rawVelTheta7 = -(pos - lqr_prevTheta) / dt;
      const float rawVelAlpha7 = -(pendPosRaw - lqr_prevAlpha) / dt;
      lqr_filteredVelTheta = velAlpha * rawVelTheta7 + (1.0f - velAlpha) * lqr_filteredVelTheta;
      lqr_filteredVelAlpha = VEL_ALPHA_PEND * rawVelAlpha7 + (1.0f - VEL_ALPHA_PEND) * lqr_filteredVelAlpha;
      lqr_prevTheta = pos;
      lqr_prevAlpha = pendPosRaw;

      // Convert to radians for network input
      const float theta_rad = pos * DEG_TO_RAD;
      const float alpha_rad = pendPosRaw * DEG_TO_RAD;
      const float theta_dot_rad = lqr_filteredVelTheta * DEG_TO_RAD;
      const float alpha_dot_rad = lqr_filteredVelAlpha * DEG_TO_RAD;

      // Run on-device inference
      float action = rl_infer_step(theta_rad, alpha_rad, theta_dot_rad, alpha_dot_rad);

