abt-st/FIRMWARE-UPDATE-QUBE-ESP32/src/firmware/esp32_qube/esp32_qube.ino
      // Normalize from [-2, 2] to [-1, 1] for PWM (network output range)
      float action_norm = action * 0.5f;
      action_norm = constrain(action_norm, -1.0f, 1.0f);
      int rl_pwm = (int)(action_norm * PWM_MAX);
      rl_pwm = constrain(rl_pwm, -PWM_MAX, PWM_MAX);
      setMotor(rl_pwm);
    }
  }
  const unsigned long nowMs = millis();
  // Failsafe: si no hay comandos recientes en modos activos, detener.
  if (ENABLE_COMMAND_TIMEOUT && mode >= 1 && mode <= 7 && (nowMs - lastCommandMs > COMMAND_TIMEOUT_MS)) {
    safeStop();
  }

  if (nowMs - lastTelemetryMs >= telemetryPeriodMs) {
    lastTelemetryMs = nowMs;
    const long c = getEncoderCountAtomic();
    const float pos = encoderDir * c * getDegPerCount() - positionOffsetDeg;
    const long pc = getPendulumCountAtomic();
    const float pendPos = pendulumDir * pc * getPendulumDegPerCount() - pendulumOffsetDeg;

    updateIna219();

    Serial.print("POS:");
    Serial.print(pos, 2);
    Serial.print(" CNT:");
    Serial.print(c);
    Serial.print(" PPOS:");
    Serial.print(pendPos, 2);
    Serial.print(" PCNT:");
    Serial.print(pc);
    Serial.print(" PA:");
    Serial.print(digitalRead(PIN_PEND_A));
    Serial.print(" PB:");
    Serial.print(digitalRead(PIN_PEND_B));
    Serial.print(" SP:");
    Serial.print(setpoint_deg, 2);
    Serial.print(" PWM:");
    Serial.print(lastPwmCmd);
    Serial.print(" M:");
    Serial.print(mode);
    if (inaOk) {
      Serial.print(" V:");
      Serial.print(busVoltageV, 2);
      Serial.print(" I[mA]:");
      Serial.print(currentmA, 1);
      Serial.print(" P[mW]:");
      Serial.print(powermW, 1);
    }
    Serial.println();
    // Broadcast via WebSocket to connected clients
    broadcastTelemetry();
  }
}
